
# Se lee el diseño .v
read_verilog mux2x1AutoCondu.v

# Síntesis high-level

# revisión de la jerarquía del diseño
hierarchy -check -top mux2x1AutoC

proc; opt

# detecta y optimiza FSM encodings
fsm; opt

# implementa memorias (arrays)
memory; opt

# convierte a compuertas logicas
techmap; opt

# Usa librería cmos_cells
abc -liberty cmos_cells.lib
show -lib cmos_cells.v

clean


# escritura del diseño sintetizado
write_verilog mux2x1ConduSynthCMOS.v
